---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ViewOrientation3D
source: html/5720ab53-4e9c-cdc1-3db3-d34d3eea4b1c.htm
---
# ViewOrientation3D Members

Constructs a new ViewOrientation3D using the input eye position, up and forward directions.